<?php 

	$books = array(
				"Рей Брэдбери" 					=> ["451° по Фаренгейту", "Вино из одуванчиков"], 
				"Грегори Дэвид Робертс"			=> ["Шантарам", "Тень горы"], 
				"Джордж Оруэлл" 				=> "1984", 
				"Михаил Афанасьевич Булгаков"	=> "Мастер и Маргарита", 
				"Эрих Мария Ремарк" 			=> "Три товарища", 
				"Оскар Уайльд" 					=> "Портрет Дориана Грея",  
				"Даниел Киз" 					=> "Цветы для Элджернона", 
				"Джером Д. Сэлинджер" 			=> "Над пропастью во ржи",
				"Антуан де Сент-Экзюпери" 		=> "Маленький принц", 
				"Лев Толстой" 					=> "Анна Каренина", 
				"Габриэль Гарсиа Маркес" 		=> "Сто лет одиночества",
				"Айн Рэнд" 						=> "Атлант расправил плечи"
			);

	foreach ($books as $author => $bookTitle) {

		if ( is_array($bookTitle) ) {
			echo "$author:";
				foreach ($bookTitle as $books) {
					echo "<li>$books</li>";
				}
		} else {
			echo "$author: $bookTitle <br>";
		}	
	}

 ?>
